# -*- coding: utf-8 -*-
import generatefeedvector
import clusters
import time

cat = {"全カテゴリ":0,  "公式発表・通達":100,   "重要な通達":101,  "公的機関からの情報":102,  "消息":103,  "安否確認・消息":104,  "避難拠点":105,  "避難所、災害支援拠点":106,  "要請":107,  "物資要請":108,  "救助・救援要請":109,  "支援要請":110,  "生活":111,  "ライフラインの状態":112,  "交通機関":113,  "住宅情報":114,  "医療・福祉、健康相談":115,  "学校・教育、育児支援":116,  "店舗、施設、サービス":117,  "生活支援・相談":118,  "雇用情報、就労支援":119,  "企業支援":120,  "情報":121,  "気象・震災関連資料":122,  "防災に役立つ情報":123,  "応急処置・健康法":124,  "震災情報メディア紹介":125,  "復興情報ニュース":126,  "各国語による情報":127,  "ペット・家畜情報":128,  "支援・応援":129,  "被災者受け入れ":130,  "物資提供、寄付":131,  "イベント情報":132,  "ボランティア募集":133,  "支援者に役立つ情報":134,  "被災地状況レポート":135,  "地場産業・物産情報":136,  "連携団体":137,  "助けあいジャパン":138,  "遠野まごころネット":139,  "ふんばろう東日本":140,  "避難生活に役立つ情報":141}    


#tryを入れる予定
cnt=0
print "cat=",len(cat)
for k,v in cat.items(): 
    for n in [10,20,30,50,100]:
#    for n in [10]:
        print n,k,v
        limit_str = str(n)
        id_str = str(v)
        feedlist = generatefeedvector.go(limit_str,id_str)
        clusters.go(limit_str,id_str,feedlist)
        cnt=cnt+1
        time.sleep(60)
print cnt, " records proceeded!"
